### Instructor Demo: Indexing

This program performs several slice and dice operations through indexing via loc and iloc functions.

In [1]:
# Import libraries and dependencies
import pandas as pd
from pathlib import Path

### Read CSV in as DataFrame

In [2]:
# Set the file path
file_path = Path("../Resources/people.csv")

# Read in the CSV as a DataFrame
people_csv = pd.read_csv(file_path)
people_csv.head()

,first_name,last_name,gender,age,company_name,address,city,county,postal,phone1,phone2,email,web
0,Aleshia,Tomkiewicz,F,54,Alan D Rosenburg Cpa Pc,14 Taylor St,St. Stephens Ward,Kent,CT2 7PP,01835-703597,01944-369967,atomkiewicz@hotmail.com,http://www.alandrosenburgcpapc.co.uk
1,Evan,Zigomalas,M,47,Cap Gemini America,5 Binney St,Abbey Ward,Buckinghamshire,HP11 2AX,01937-864715,01714-737668,evan.zigomalas@gmail.com,http://www.capgeminiamerica.co.uk
2,France,Andrade,M,42,"Elliott, John W Esq",8 Moor Place,East Southbourne and Tuckton W,Bournemouth,BH6 3BE,01347-368222,01935-821636,france.andrade@hotmail.com,http://www.elliottjohnwesq.co.uk
3,Ulysses,Mcwalters,M,45,"Mcmahan, Ben L",505 Exeter Rd,Hawerby cum Beesby,Lincolnshire,DN36 5RP,01912-771311,01302-601380,ulysses@hotmail.com,http://www.mcmahanbenl.co.uk
4,Tyisha,Veness,F,37,Champagne Room,5396 Forth Street,Greets Green and Lyng Ward,West Midlands,B70 9DT,01547-429341,01290-367248,tyisha.veness@hotmail.com,http://www.champagneroom.co.uk

### View Summary Statistics (Default Numeric)

In [3]:
# View the summary statistics for the DataFrame, the describe() function defaults to only numerical data
people_csv.describe()

              age
count  500.000000
mean    42.130000
std     10.702625
min     24.000000
25%     33.000000
50%     43.000000
75%     52.000000
max     60.000000

### View Summary Statistics (All Columns)

In [4]:
# View the summary statistics for the DataFrame, include all columns
people_csv.describe(include="all")

,first_name,last_name,gender,age,company_name,address,city,county,postal,phone1,phone2,email,web
count,500,500,500,500.000000,500,500,500,500,500,500,500,500,500
unique,479,498,2,NaN,498,500,468,102,500,500,500,500,498
top,Erasmo,Rampy,F,NaN,Martin Morrissey,784 Juno St #7653,City and Hunslet Ward,Greater London,GL7 2EY,01989-617161,01222-164469,cbludworth@yahoo.com,http://www.mailboxesetc.co.uk
freq,3,2,301,NaN,2,1,3,44,1,1,1,1,2
mean,NaN,NaN,NaN,42.130000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
std,NaN,NaN,NaN,10.702625,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
min,NaN,NaN,NaN,24.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25%,NaN,NaN,NaN,33.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
50%,NaN,NaN,NaN,43.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
75%,NaN,NaN,NaN,52.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
max,NaN,NaN,NaN,60.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### Index Selection Using iloc

In [5]:
# Select the first row of the DataFrame

In [6]:
# Select the second row of the DataFrame

In [7]:
# Select the first 10 rows of the DataFrame

In [8]:
# Select the last row of the DataFrame

In [9]:
# Select the first column of the DataFrame

In [10]:
# Select the second column of the DataFrame, with all rows

In [11]:
# Select the last column of the DataFrame, with all rows

In [12]:
# Select the first two columns of the DataFrame, with all rows

In [13]:
# Select the 1st, 5th, 8th, 22nd rows of the 1st 4th and 6th columns.

In [14]:
# Select the first 5 rows of the 3rd, 4th, and 5th columns of the DataFrame

### Assignment Using iLoc

In [15]:
# Modify the 'first_name' column value of the first row

### Index Selection Using Loc

In [16]:
# Set the index as the 'first_name' column

In [17]:
# Sort the index

In [18]:
# Select the row with the index 'Evan'

In [19]:
# Slice the data to output a range of rows based on the index

In [20]:
# Filter rows based on a column value conditional

### Assignment Using Loc

In [21]:
# Modify the 'first_name' value of the row with the index 'Yun'

In [22]:
# 'first_name' modification